<html>
<head>
<title>ATCM Console starten \ Verbindung zu ATCM Control herstellen und beenden</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="Manual_GE.css">
</head>

<body bgcolor="#FFFFFF" background="pic/backgrnd.jpg">
<h1> ATCM Console starten \ Verbindung zu ATCM Control herstellen und beenden</h1>
<hr>
<h3><a name="overview"></a>&Uuml;bersicht</h3>
<ul>
  <a href="#TwoFourC">Verbindungsm&ouml;glichkeiten / Starten von ATCM Console</a> 
  <ul class="inul">
    <a href="#byTray">Starten von ATCM Console &uuml;ber das ATCM Tray</a><br>
    <a href="#byEngineering">Starten von ATCM Console aus ATCM Engineering</a><br>
    <a href="#byExplorer">Starten von ATCM Console durch Eingabe der Startadresse 
    im Internet Explorer</a> 
  </ul>
  <a href="#password">Pa&szlig;wortschutz</a><br>
  <a href="#end">Eine Verbindung zu ATCM Control beenden</a> 
</ul>
<hr style="margin-left: 44px">
<h2><a name="TwoFourC"></a><a href="#overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Verbindungsm&ouml;glichkeiten / Starten von ATCM Console</h2>
<p>Eine Konfiguration kann in ATCM Engineering nicht nur dem lokalen Rechner, sondern 
  auch einem Remote-Rechner zugewiesen werden. Konfiguration und PC sind in ATCMControl 
  nach der Zuweisung einer Konfiguration an einen PC praktisch identisch. Eine 
  Konfiguration wird zur Ausf&uuml;hrung auf das Control des Rechners geladen, 
  der der entsprechenden Konfiguration zugeordnet wurde. Es ist auf diese Weise 
  bspw. m&ouml;glich, ein Projekt in ATCM Engineering auf dem lokalen Rechner zu 
  compilieren, und auf einem Remote-Rechner auszuf&uuml;hren, d.h. auf das Control, 
  das sich auf dem Remote-Rechner befindet, zu laden. Falls Sie &uuml;ber eine 
  Lizenz f&uuml;r Mehrfachkonfigurationen verf&uuml;gen, k&ouml;nnen Sie in einem 
  Projekt auch mehrere Konfigurationen anlegen, die jeweils einem anderen PC zugewiesen 
  sind und daher auf dem Control des jeweiligen PCs ausgef&uuml;hrt werden. </p>
<p>In einer gestarteten Instanz von ATCM Console werden jeweils die Proze&szlig;daten 
  einer einzelnen Konfiguration visualisiert. ATCM Console stellt dazu &uuml;ber 
  die OPC-Schnittstelle eine Verbindung zu dem Control des der Konfiguration zugewiesenen 
  Rechners her. Vom lokalen Rechner aus kann sowohl die Konfiguration, die auf 
  dem Control des lokalen Rechners ausgef&uuml;hrt wird, als auch eine Konfiguration, 
  die auf einem Remote-Rechner l&auml;uft, in ATCM Console visualisiert und beobachtet 
  werden. Ebenso ist es m&ouml;glich, dieselbe auf ein ATCM Control geladene Konfiguration 
  von mehreren Remote-Rechnern aus in ATCM Console zu beobachten. </p>
<p>Die Auswahl der zu visualisierenden Konfiguration und damit des entsprechenden 
  Controls erfolgt bereits mit dem Start von ATCM Console, d.h. der Kontext, aus 
  dem heraus ATCM Console gestartet wurde, entscheidet dar&uuml;ber, von welchem 
  Control die visualisierten Daten stammen. Zum Starten von ATCM Console stehen 
  drei M&ouml;glichkeiten zur Verf&uuml;gung:</p>
<ul>
  <li><a href="#byTray">Starten &uuml;ber das ATCM Tray auf der Windows Programmleiste</a></li>
  <li><a href="#byEngineering">Starten aus ATCM Engineering</a></li>
  <li><a href="#byExplorer">Starten &uuml;ber die Eingabe der Startadresse im 
    Adressfeld des Internet Explorers </a></li>
</ul>
<p> Bei mehreren Konfigurationen in einem einzigen Projekt kann die Konfiguration 
  auch noch nach dem Start von ATCM Console gewechselt werden.</p>
<p>Beim Start von ATCM Console &uuml;ber das ATCM Tray oder durch Eingabe einer Startadresse 
  im Adressfeld des Internet Explorers k&ouml;nnen alle im Projekt enthaltenen 
  Objekte &uuml;ber den <a href="Interface_GE.htm#NaviView">Navigator von ATCM Console</a> 
  in ein <a href="faceplate_GE.htm">Display</a> geladen und dort angezeigt werden. 
  Die Anordnung der diesen Objekten zugeordneten Displays kann &uuml;ber das <b>Kontext</b>-Men&uuml; 
  oder den Layout-Editor ver&auml;ndert werden (siehe Abschnitt <a href="Layout_GE.htm#Layout">Mit 
  Layouts arbeiten</a>). Wird ATCM Console dagegen aus ATCM Engineering gestartet, 
  ist die Auswahl der Objekte, die in ein Display geladen werden k&ouml;nnen, 
  abh&auml;ngig von der Aufrufposition von ATCM Console (siehe <a href="#byEngineering">Starten 
  von ATCM Console aus ATCM Engineering</a>). </p>
<img src="pic/Note.gif"
        width="32" height="32" align="left"> 
<div style="margin-left: 5; position: relative; top: 0"> 
  <table border="0" cellpadding="0" class="tabhinweis">
    <tr> 
      <td class="HinweisText"> Unabh&auml;ngig davon, auf welche Weise ATCM Console 
        gestartet wurde, k&ouml;nnen mehrere Instanzen von ATCM Console zugleich 
        aufgerufen werden. Um Probleme beim Arbeiten mit mehreren Instanzen von 
        ATCM Console zu vermeiden, sollten Sie in den in den<b> Internetoptionen</b> 
        des Internet Explorers in der Registerkarte <b>Erweitert</b> das Kontrollk&auml;stchen 
        <b>Bowserfenster in einem eigenen Proze&szlig; &ouml;ffnen</b> markieren.</td>
    </tr>
  </table>
</div>
<h3><a name="byTray"></a><a href="#overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Starten von ATCM Console über das ATCM Tray </h3>
<p>Beim Start &uuml;ber das ATCM Tray wird ATCM Console als Standalone-Applikation 
  innerhalb des Internet-Explorers ge&ouml;ffnet. In einer &uuml;ber das ATCM Tray 
  gestarteten ATCM Console werden immer die Proze&szlig;daten des sich auf dem lokalen 
  Rechner befindenden Controls visualisiert. </p>
<p>Um ATCM Console &uuml;ber das ATCM Tray zu starten</p>
<p>klicken sie mit der linken Maustaste doppelt auf das sich am rechten bzw. unteren 
  Ende der Windows-Taskleiste befindende ATCMControl Symbol <img src="pic/IcControlgreen.gif" width="16" height="16"><br>
  <br>
  - ODER -<br>
  <br>
  klicken Sie mit der rechten Maustaste auf das ATCMControl-Symbol <img src="pic/IcControlgreen.gif" width="16" height="16">, 
  um dessen <b>Kontext</b>-Men&uuml; zu &ouml;ffnen, und w&auml;hlen Sie <b>Open 
  ATCM Console</b>.</p>
<h3><a name="byEngineering"></a><a href="#overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Starten von ATCM Console aus ATCM Engineering</h3>
<p>Beim Start aus ATCM Engineering wird ATCM Console als Fenster innerhalb von ATCM 
  Engineering ge&ouml;ffnet, d.h. das ATCM Console-Fenster kann nur innerhalb von 
  ATCM Engineering verschoben werden. Es k&ouml;nnen mehrere Instanzen von ATCM Console 
  aus ATCM Engineering aufgerufen werden. Jede Instanz wird in einem eigenen Fenster 
  innerhalb von ATCM Engineering dargestellt.</p>
<p>Ein aus ATCM Engineering gestartetes Konsolenfenster enth&auml;lt mit Ausnahme 
  des <b>Kontext</b>-Men&uuml;s nur die ATCM Control-spezifischen Bedien- und Visualisierungselemente. 
  Ein Teil der Internet Explorer-Funktionalit&auml;t wird durch eine Schaltfl&auml;chengruppe 
  ersetzt, die die wichtigsten Navigationsfunktionen zur Verf&uuml;gung stellt. 
  Erl&auml;uterungen zu dieser Schaltfl&auml;chengruppe finden Sie im Abschnitt 
  <a href="Interface_GE.htm#IEPanel">Internet-Navigationsleiste in ATCM Engineering</a>. 
</p>
<p>Der Start von ATCM Console aus ATCM Engineering erfolgt &uuml;ber das <b>Kontext</b>-Men&uuml; 
  des Navigators von ATCM Engineering.<br>
  Das <b>Kontext</b>-Men&uuml; des Engineering-Navigators mit einem Men&uuml;punkt 
  zum &Ouml;ffnen von ATCM Console kann von folgenden Positionen aus aufgerufen 
  werden:</p>
<dl> 
  <dt><b>In der Hardware-Ansicht </b></dt>
  <dd>von einem PC-Symbol <img src="pic/PCSymb.gif" width="22" height="18" align="top"></dd>
  <dt><b>In der Instance-Ansicht </b></dt>
  <dd>von dem Symbol einer Konfiguration <img src="pic/ConfigSymb.gif" width="23" height="19" align="top">,<br>
    einer Ressource <img src="pic/ResourceSymb.gif" width="24" height="19" align="top"><br>
    oder einer Task<img src="pic/TaskSymb.gif" width="24" height="17" align="top">.</dd>
</dl>
<p>Klicken Sie nach der Auswahl eines dieser Symbole mit der rechten Maustaste, 
  um das <b>Kontext</b>-Men&uuml; aufzurufen und w&auml;hlen Sie dort die Option 
  <b>Open ATCM Console</b>.</p>
<p><a name="StartPosition"></a>Mit welchem Control ATCM Console beim Start aus ATCM 
  Engineering verbunden und welches Objekt der Konfiguration visualisiert wird, 
  ist abh&auml;ngig von der Aufrufposition, die f&uuml;r das &Ouml;ffnen des<b> 
  Kontext</b>-Men&uuml;s gew&auml;hlt wurde. </p>
<p>Falls im aktuell in ATCM Engineering ge&ouml;ffneten Projekt nur eine Konfiguration 
  angelegt wurde, werden immer die Proze&szlig;daten visualisiert, die auf dem 
  Control geladen sind, das sich auf dem der Konfiguration zugewiesenen PC befindet. 
  Dies kann sowohl der lokale PC, als auch ein Remote-Rechner sein. Die gesamten 
  in der Konfiguration enthaltenenen Objekte stehen im Navigator von ATCM Console 
  zur Auswahl zur Verf&uuml;gung, wenn die Aufrufposition des <b>Kontext</b>-Men&uuml;s 
  das PC-Symbol oder das Konfigurations-Symbol ist. Beim Aufruf des <b>Kontext</b>-Men&uuml;s 
  aus der Position eines Ressourcen-Symbols wird die <a href="faceplate_GE.htm#TaskList">Taskliste</a> 
  der Konfiguration angezeigt, beim Aufruf aus der Position eines Task-Symbols 
  dagegen das <a href="faceplate_GE.htm#TasksFP">Faceplate der zuvor selektierten 
  Task </a>(N&auml;heres zu Navigator und Faceplates in ATCM Console erfahren Sie 
  in den Abschnitten <a href="Interface_GE.htm">Benutzeroberfl&auml;che</a> und 
  <a href="faceplate_GE.htm">Displays</a>). Der Navigator wird bei Aufruf aus 
  den letzten beiden Positionen nicht eingeschr&auml;nkt; die Auswahl der Objekte 
  ist daher eingeschr&auml;nkt. </p>
<p>Falls Sie eine Lizenz f&uuml;r Mehrfachkonfigurationen besitzen, k&ouml;nnen 
  Sie in einem Projekt auch mehrere Konfigurationen angelegen. In diesem Fall 
  wird ATCM Console mit dem Control verbunden, das sich auf dem PC befindet, dessen 
  zugeordnete Konfiguration oder ein sich unter der Konfiguration befindendes 
  Symbol als Aufrufposition f&uuml;r das <b>Kontext</b>-Men&uuml; ausgew&auml;hlt 
  wurde. Beim Start aus der im folgende Bild zu sehenden Aufrufposition des <b>Kontext</b>-Men&uuml;s 
  wird ATCM Console bspw. mit dem <i>Configuration2</i> zugeordneten Control verbunden. 
</p>
<img src="pic/CallConsole.gif" width="285" height="502" class="inP"> 
<h3><a name="byExplorer"></a><a href="#overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Starten von ATCM Console durch Eingabe der Startadresse im Internet Explorer</h3>
<p>Beim Start von ATCM Console aus dem Internet Explorer kann bei Eingabe der Startadresse 
  der PC angegeben werden, mit dessen Control ATCM Console verbunden werden soll:</p>
<ol>
  <li>Starten Sie den Internet Explorer.</li>
  <li>Geben Sie im Feld <b>Adresse</b> die gew&uuml;nschte Startseite ein. Die 
    Adresse mu&szlig; folgender Syntax entsprechen:<br>
    '<font face="Courier New, Courier, mono">http//&lt;Name des PC's&gt;/4C</font>'. 
    Hat Ihr PC bspw. den Namen <i>Automation1</i>, lautet die Adresse '<font face="Courier New, Courier, mono">http//Automation1/4C</font>'.</li>
  <li>Klicken Sie auf <b>Wechseln zu </b>oder dr&uuml;cken Sie die <b>Enter</b>-Taste, 
    um die eingegebene Adresse aufzurufen.</li>
</ol>
<h2><a name="Password"></a><a href="#overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Pa&szlig;wortschutz</h2>
<p>In ATCM Engineering kann ein Pa&szlig;wort f&uuml;r das aktuell geladenene Projekt 
  vergeben werden (siehe auch den Abschnitt projektbezogenes Pa&szlig;wort vergeben), 
  das nach der Compilation des Projekts wirksam wird. Wenn eine in einem pa&szlig;wortgesch&uuml;tzten 
  Projekt enthaltenen Konfiguration auf ein ATCM Control geladen wird, erfolgt beim 
  Start von ATCM Console eine Pa&szlig;wortabfrage. Die Eingabe eines Pa&szlig;worts 
  wird bei pa&szlig;wortgesch&uuml;tzten Projekten unabh&auml;ngig davon verlangt, 
  ob das zu verbindende Control sich auf dem lokalen oder auf einem Remote-Rechner 
  befindet. Die Abfrage erfolgt allerdings nur, wenn ATCM Console au&szlig;erhalb 
  von ATCM Engineering, also &uuml;ber das ATCM Tray oder &uuml;ber das Adressfeld 
  des Internet Explorers gestartet wurde.</p>
<p>Die Sicherheitsüberprüfung unterscheidet zwei Zugriffsstufen auf die Konsole:</p>
<ul>
  <li> <b>Nur Lese-Zugriff:</b> Die Konsole kann gestartet, und die Prozeß-Variablen 
    können überwacht werden. Die Einschränkung des Nur- Lese-Zugriffs besteht 
    darin, daß normalerweise veränderbare Werte von Prozeß-Variablen nicht verändert 
    werden können. Ebensowenig k&ouml;nnen Tasks und Resourcen gestartet oder 
    gestoppt werden. </li>
  <li><b>Uneingeschränkter Zugriff:</b> Werte von Prozeß-Variablen können gelesen 
    als auch verändert werden, falls ein Schreibzugriff auf die entsprechende 
    Variable vom zugeordneten Display vorgesehen ist. Tasks und Resourcen können 
    gestartet und gestoppt werden. </li>
</ul>
<p>Welche Zugriffsstufe für eine Konfiguration gültig ist, wird bei Vergabe des 
  Paßworts in ATCM Engineering (im Menü <b>Tools - Project Settings... </b>Registerkarte<b> 
  </b> <b>Console</b>) festgelegt.</p>
<p>Beachten Sie bitte, da&szlig; die Pa&szlig;wortabfrage auch dann erfolgt, wenn 
  Sie bspw. nach einem Download die gesamte Visualisierungs-Ansicht von ATCM Console 
  &uuml;ber die Schaltfl&auml;che <b>Aktualisieren</b> auf der Werkzeugleiste 
  des Internet Explorers oder ein einzelnes Display &uuml;ber das Explorer <b>Kontext</b>-Men&uuml; 
  des Displays aktualisieren. In letzterem Fall wird der Pa&szlig;wort-Dialog 
  nur in das aktualisierte Display eingeblendet, da die restlichen Displays nicht 
  von der Aktualisierung betroffen sind. </p>
<h4><a name="login"></a>Einloggen in ATCM Console<br>
  <br>
</h4>
<img src="pic/LoginScreen2.gif" width="447" height="405" class="inP">
<p>Um sich im Falle eines Pa&szlig;wortschutzes in ATCM Console einzuloggen, geben 
  Sie das Pa&szlig;wort in das Eingabefeld ein und best&auml;tigen Ihre Eingabe 
  durch Klicken auf <b>Enter</b>.<br>
  Falls Sie sich verschrieben haben, k&ouml;nnen Sie das Eingabefeld durch Klicken 
  auf <b>Reset</b> wieder in seinen leeren Ausgangszustand zur&uuml;cksetzen, 
  und die Eingabe wiederholen. </p>
<p>Wenn Sie ein ungültiges Paßwort eingeben, wird der Zugriff auf die Konsole 
  verweigert und das Login-Dialogfeld neu gestartet.<br>
  Wenn Sie dagegen ein gültiges Paßwort eingeben, wird eine Konsolen-Sitzung einschließlich 
  aller Zugangsrechte, die über das eingegebene Paßwort zur Verfügung gestellt 
  werden, gestartet.</p>
<h2><a name="end"></a><a href="#overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Eine Verbindung zu ATCM Control beenden</h2>
<p> Eine bestehende Verbindung wird abgebrochen, wenn die folgenden Ereignisse 
  auftreten: </p>
<ul>
  <li>Die <b>Logout</b>-Schaltfläche in der Konsole wird gedrückt. </li>
  <li>Auf das mit ATCM Console verbundene Control wird ein neues Projekt geladen.</li>
  <li> Die Verbindung wird bspw. durch Schließen des Internet Explorers beendet 
    und nicht in einem Zeitraum von c.a. 30 Sekunden erneut gestartet. In diesem 
    Fall gehen die auf dem Server abgelegten Daten zur aktuellen Verbindung verloren. 
  </li>
</ul>
<p>Die <b>Logout</b>-Schaltfläche befindet sich auf der Symbolleiste von ATCM Console. 
  Sie wird nur dann angezeigt, wenn die geladenene Konfiguration mit einem Pa&szlig;wort 
  gesch&uuml;tzt ist. Besitzt die aktuell geladenen Konfiguratio kein Pa&szlig;wort, 
  ist diese Schaltfl&auml;che dagegen nicht sichtbar. <br>
  Bei Klick auf die <b>Logout</b>-Schaltfl&auml;che wird die bestehende Verbindung 
  beendet, und der Login-Dialog wieder angezeigt. <br>
  Wie Sie aus dem Feld <b>Adresse</b> im Internet Explorer oder - falls Sie ATCM 
  Console aus ATCM Engineering gestartet haben - sehen k&ouml;nnen, bezieht sich 
  der Pa&szlig;wort-Dialog immer noch auf den Zugriff auf das Control des Rechners, 
  mit dem Sie zuvor eine Verbindung hergestellt haben. Wenn Sie sich nach dem 
  Ausloggen erneut mit demselben Pa&szlig;wort wieder einloggen, stellen Sie wieder 
  eine Verbindung zu dem zuvor verbundenen Control her. </p>
</body>
</html>
