<html>
<head>
<title>ATCM Console Benutzeroberfläche</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="Manual_GE.css">
</head>

<body bgcolor="#FFFFFF" background="pic/backgrnd.jpg">
<h1>Benutzeroberfl&auml;che</h1>
<hr>
<h3><a name="overview"></a>&Uuml;bersicht </h3>
<ul>
  <a href="#general">Aufbau</a><br>
  <a href="#VisuView"> Die Visualisierungs-Ansicht</a> 
  <ul class="inul">
    <a href="#NaviEtVisu">Zusammenarbeit von Visualisierungs- und Navigator-Ansicht</a><br>
    <a href="#LoadObject">Objekte in einem Display laden und visualisieren</a><br>
  </ul>
  <a href="#NaviView">Die Navigator-Ansicht</a> 
  <ul class="inul">
    <a href="#TabProject">Die Registerkarte Project</a><br>
    <a href="#TabFB">Die Registerkarte Function Blocks</a> 
  </ul>
  <a href="#Toolbar">Die Werkzeugleiste</a><br>
  <a href="#Statusbar">Die Statuszeile</a><br>
  <a href="#IEPanel">Die Internet-Navigationsleiste in ATCM Engineering</a><br>
  <a href="#InternetFunctions">Die Internet-Funktionen</a> 
  <ul class="inul">
    <a href="#Refresh">Die Navigator- und Visualisierungs-Ansicht aktualisieren</a><br>
    <a href="#navigate">In der Visualisierungs-Ansicht navigieren</a> 
  </ul>
</ul>
<hr style="margin-left: 44px">
<h2><a name="general"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Aufbau</h2>
<p>ATCM Console ist eine in den Internet Explorer eingebettete Anwendung. Die grafische 
  Oberfl&auml;che von ATCM Console wird mit Hilfe von HTML, ASP, Java Script und 
  VB Script realisiert und als HTML-Seite im Fenster des Internet Explorers dargestellt. 
  Prinzipiell stehen Ihnen daher bei der Arbeit mit ATCM Console alle Bedienelemente 
  und die gesamte Funktionalit&auml;t des Internet Explorers zur Verf&uuml;gung. 
  Beim Start von ATCM Console aus ATCM Engineering enth&auml;lt das Konsolenfenster 
  mit Ausnahme des <b>Kontext</b>-Men&uuml;s allerdings nur die ATCM Control-spezifischen 
  Bedien- und Visualisierungselemente. Ein Teil der Internet Explorer-Funktionalit&auml;t 
  wird durch eine Schaltfl&auml;chengruppe ersetzt, die die wichtigsten Navigationsfunktionen 
  zur Verf&uuml;gung stellt. Erl&auml;uterungen zu dieser Schaltfl&auml;chengruppe 
  finden Sie im Abschnitt <a href="#IEPanel">Internet-Navigationsleiste in ATCM 
  Engineering</a>. Zur Navigation in ATCM Console &uuml;ber die Internet-Funktionen 
  siehe <a href="#navigate">In der Visualisierungs-Ansicht navigieren</a>. </p>
<p>Die eigentliche Bedienoberfl&auml;che von ATCM Console beginnt unterhalb der 
  Men&uuml;- und Symbolleiste des Internet Explorers und gliedert sich in 4 Bereiche:</p>
<ul>
  <li><a href="#NaviView">Navigator-Ansicht</a> (linke Seite der Bedienoberfl&auml;che)</li>
  <li><a href="#VisuView">Visualisierungsbereich</a> (rechte Seite der Bedienoberfl&auml;che, 
    ist meist in mehrere Anzeigemodule unterteilt) 
  <li><a href="#Toolbar">Werkzeugleiste</a></li>
  <li><a href="#Statusbar">Statuszeile</a></li>
</ul>
<img src="pic/INetConsole.gif" width="549" height="538" class="inP">
<h2><a name="VisuView"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Die Visualisierungs-Ansicht</h2>
<h3><a name="NaviEtVisu"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Zusammenarbeit von Visualisierungs- und Navigator-Ansicht</h3>
<p>Visualisierungs- und <a href="#NaviView">Navigator-Ansicht</a> h&auml;ngen 
  aufs Engste miteinander zusammen. W&auml;hrend in der Visualisierungs-Ansicht 
  auf ATCM Control geladene Proze&szlig;daten angezeigt und gegebenenfalls grafisch 
  dargestellt werden, wird &uuml;ber die Navigator-Ansicht geregelt, welche Daten 
  in der Visualisierungsansicht zu sehen sind. Entsprechend der Objekthierarchie 
  des ATCMControl-Programmiermodells k&ouml;nnen Daten Objekten (z.B. Funktionsbausteinen, 
  Programmen, Tasks, Ressourcen) zugeordnet und in Einheiten zusammengefa&szlig;t 
  werden. Dementsprechend werden auch von ATCM Control gelieferte Proze&szlig;daten 
  zur Darstellung in der Visualisierungs-Ansicht in optische Einheiten zusammengefa&szlig;t, 
  die diesem Programmiermodell entsprechen. Die Auswahl des in einer Visualisierungseinheit 
  dargestellten Objekts erfolgt &uuml;ber die Navigator-Ansicht, die die im Projekt 
  enthaltenen Objekte gem&auml;&szlig; der Hierarchie des IEC-Programmiermodells 
  in Baumstruktur darstellt. Jedes Objekt in der Baumstruktur hat Hyperlinkcharakter, 
  soda&szlig; ein Klick auf ein Objekt in der Navigator-Ansicht zur Darstellung 
  in einer Visualisierungseinheit der Visualisierungs-Ansicht f&uuml;hrt. </p>
<p> Eine einzelne Visualisierungseinheit, die wir im folgenden als Display bezeichnen 
  werden, erkennen Sie an dem grauen Rahmen, der jedes Display umgibt. Gr&ouml;&szlig;e 
  und Position der Displays k&ouml;nnen ver&auml;ndert werden. Wenn Sie ATCM Console 
  zum ersten Mal starten, sind die Displays zun&auml;chst noch leer, und die Kopfleisten 
  der Displays zeigen dementsprechend die Beschriftung <i>Empty</i>.</p>
<img src="pic/4CConsole.gif" width="560" height="528" class="inP"> 
<h3><a name="LoadObject"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Objekte in einem Display laden und visualisieren</h3>
<p>Um in einem der noch leeren Displays die Proze&szlig;daten eines Objekts zu 
  laden, klicken Sie in der Navigator-Ansicht auf ein Symbol, hinter dem sich 
  eine blaue und unterstrichene Bezeichnung befindet. Statt auf das Symbol k&ouml;nnen 
  Sie auch auf die Bezeichnung klicken. Die blaue Farbe und die Unterstreichung 
  signalisieren, da&szlig; es sich bei dem entsprechenden Objekt um einen Link 
  handelt, bei dessen Aktivierung die zu dem angeklickten Objekt geh&ouml;renden 
  Proze&szlig;daten in dem aktuell aktiven Display angezeigt werden. <br>
  Welche Objekte in der Navigator-Ansicht f&uuml;r die Visualisierung zur Verf&uuml;gung 
  stehen und in welcher Hierarchie diese angeordnet sind, erfahren Sie im Abschnitt 
  <a href="#NaviView">Navigator-Ansicht</a>. </p>
<p>Die Proze&szlig;daten eines im Navigator angeklickten Objekts werden immer 
  in das aktuell aktive Display geladen. Das aktuell aktive Display erkennen Sie 
  an der gelben Farbe der Kopfleiste, w&auml;hrend die Kopfleisten von inaktiven 
  Displays die Farbe blau besitzen. Noch w&auml;hrend des Ladens der Daten wird 
  das n&auml;chste Display aktiv, wogegen das zuvor aktive Display wieder in den 
  Status inaktiv wechselt. Das bedeutet, da&szlig; beim n&auml;chsten Klicken 
  auf ein Objekt im Navigator dessen Proze&szlig;daten jetzt in das nachfolgende 
  Display geladen werden. Objekte werden grundsätzlich in der Richtung von links 
  nach rechts und bei mehreren Reihen von oben nach unten, wenn das letzte Display 
  einer Reihe erreicht ist, eingefügt.</p>
<img src="pic/Faceplateorder.gif" width="505" height="570" class="inP"> 
<p>Sie m&uuml;ssen sich allerdings nicht an diese Standardreihenfolge halten. 
  Sie k&ouml;nnen ein Display auch gezielt aktivieren und damit festlegen, in 
  welches Display ein Objekt eingef&uuml;gt werden soll.</p>
<p>So f&uuml;gen Sie ein Objekt in ein von Ihnen frei gew&auml;hltes Display ein:</p>
<ol>
  <li>Klicken Sie mit der linken Maustaste auf die Kopfleiste des gew&uuml;nschten 
    Displays. Die Kopfleiste signalisiert durch Farb&auml;nderung, da&szlig; das 
    Display jetzt aktiv ist.</li>
  <li>Klicken Sie auf das gew&uuml;nschte Objekt in der Navigator-Ansicht von 
    ATCM Console. Das selektierte Objekt wird in das aktuell aktive Display eingef&uuml;gt. 
    Die Kopfleiste des Displays zeigt den Namen des Objekts an.</li>
</ol>
<p>Auf die oben beschriebene Weise k&ouml;nnen Sie auch dem Display ein anderes 
  Objekt zuweisen, wenn in dem entsprechenden Display bereits Objektdaten visualisiert 
  werden. Aktivieren Sie dazu das einfach das gew&uuml;nschte Display per Mausklick 
  auf dessen Kopfleiste, und w&auml;hlen Sie ein anderes Objekt in der Navigator-Ansicht 
  aus. </p>
<p>Displays k&ouml;nnen nicht nur innerhalb von ATCM Console, sondern auch in einem 
  eigenen Fenster au&szlig;erhalb von ATCM Console dargestellt werden.<br>
  Um ein Display in einem eigenen Fenster darzustellen, klicken Sie in der Navigator-Ansicht 
  auf das gew&uuml;nschte Objekt, w&auml;hrend Sie die <b>STRG</b>-Taste gedr&uuml;ckt 
  halten. Das Display wird jetzt als eigenes Fenster dargestellt.</p>
<img src="pic/FaceplateExtra.gif" width="371" height="457" class="inP">
<p>Die Anordnung und Gr&ouml;&szlig;e der Displays kann mit Hilfe des <a href="Layout_GE.htm#EditLayout">Layout 
  Editors</a> und des Kontext-Men&uuml;s ver&auml;ndert werden. Sie dazu das Kapitel 
  <a href="Layout_GE.htm">Layouts</a>.</p>
<h2><a name="NaviView"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Die Navigator-Ansicht</h2>
<div style="margin-left: 5; position: relative; top: 0"> 
  <p>&Uuml;ber die Navigator-Ansicht wird die Anzeige der Displays in der <a href="#VisuView">Visualisierungs-Ansicht</a> 
    gesteuert. Sie stellt die in ihrem Projekt enthaltenen Objekte (Funktionsbaustein-Instanzen, 
    Programme, Tasks usf.) in Baumstruktur dar. Alle Objekte werden mit einem 
    Symbol und dem Namen des Objekts angezeigt. Die meisten Objektnamen sind unterstrichen 
    und werden in blauer Farbe dargestellt. Die Objektnamen signalisieren damit, 
    da&szlig; es sich bei diesen Repr&auml;sentationen der Objekte um Hyperlinks 
    handelt, &uuml;ber die die Daten des ausgew&auml;hlten Objekts in einem Display 
    geladen und visualisiert werden k&ouml;nnen. </p>
  <p>Um die Daten eines Objekts in einem Display zu laden gehen Sie folgenderma&szlig;en 
    vor: </p>
</div>
<ol>
  <li> 
    <div style="margin-left: 5; position: relative; top: 0">Aktivieren Sie in 
      der Visualisierungs-Ansicht das Display, in dem das Objekt dargestellt werden 
      soll, indem Sie in dessen Kopfleiste klicken. Wenn Sie ein Display nicht 
      explizit aktivieren, beziehen sich alle nachfolgenden Aktionen auf das Display, 
      das nach der von der Visualisiungsansicht vorgegebenen Standardreihenfolge 
      aktiv ist (siehe <a href="#LoadObject">Objekte in einem Display laden und 
      visualisieren</a>).</div>
  </li>
  <li> 
    <div style="margin-left: 5; position: relative; top: 0">Klicken Sie in der 
      Navigator-Ansicht auf das gew&uuml;nschte Objekt. Das Objekt wird in dem 
      zuvor aktivierten Display angezeigt. </div>
  </li>
</ol>
<p>Die Navigator-Ansicht gliedert sich in die Registerkarten <b>Project</b> und 
  <b>Function Blocks</b>, in denen die Objekte des auf ATCM Control geladenen Projekts 
  jeweils in einer Baumstruktur dargestellt sind. Die Organisation der Baumstruktur 
  unterscheidet sich in beiden Registerkarten. </p>
<h3><a name="TabProject"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Die Registerkarte Project</h3>
<img src="pic/Project.gif" width="238" height="394" align=left class="inP" style="margin-right: 15px"> 
<p>Die Projekt-Ansicht entspricht im Wesentlichen der Instance-Ansicht des Navigators 
  von ATCM Engineering. In beiden Ansichten orientiert sich Darstellung der in Baumstruktur 
  angeordneten Objekte an der Struktur des Programmiermodells von ST bzw. FBD. 
  Ebenen der Baumstruktur leiten sich aus der Objekt- bzw. Aufrufhierarchie eines 
  Projekts ab. Bspw. k&ouml;nnen Tasks Programm-Instanzen aufrufen, die ihrerseits 
  Funtionsbaustein-Instanzen aufrufen usf. Dementsprechend wird jedes aufgerufene 
  Objekt eine Ebene unterhalb des aufrufenden Objekts dargestellt. Im folgenden 
  wird eine &Uuml;bersicht der Baumstruktur organisierten Objekte gegeben. Einzelheiten 
  zur Visualisierung dieser Objekt in den Displays finden Sie im Kapitel <a href="faceplate_GE.htm">Displays</a>.</p>
<p>Zuoberst der Baumstruktur befindet sich das <b>Projektsymbol mit dem Projektnamen</b>. 
  Da nur die im Projekt enthaltenen Objekte, nicht jedoch das Gesamtprojekt in 
  der Visualisierungsansicht dargestellt werden kann, hat das Anklicken des Projektsymbols 
  oder -namens keine Auswirkung auf die Darstellung in der Visualisierungsansicht. 
</p>
<p>Direkt unterhalb des Projektsymbols befindet sich immer die <b>Configuration 
  List</b>. Diese hat keine Entsprechung in der Instanz-Ansicht von ATCM Engineering. 
  Falls Sie &uuml;ber eine Multikonfigurations-Lizenz verf&uuml;gen, kann ein 
  Projekt mehrere Konfigurationen enthalten. Die Configuration List gibt einen 
  &Uuml;berblick &uuml;ber alle in einem PC enthaltenen Konfigurationen, sofern 
  diese auf ein Control geladen sind. Ist zwar eine g&uuml;ltige Konfiguration 
  im Projekt angelegt und auch einem PC zugeordnet, die Konfiguration jedoch nicht 
  auf das zugeordnete Control geladen worden, wird diese Konfiguration nicht in 
  der Liste aufgef&uuml;hrt. </p>
<p>Die in einem Projekt enthaltenen <b>Konfigurationen</b> befinden sich in der 
  Baumstruktur auf der gleichen Hierarchieebene wie die Configuration List, jedoch 
  immer unterhalb der Configuration List. In der Baumstruktur kann immer nur eine 
  Konfiguration mittels Mausklick auf das Plussymbol expandiert werden, w&auml;hrend 
  alle anderen Konfigurationen nicht &uuml;ber ein Plussymbol verf&uuml;gen. Stattdessen 
  sind die anderen Konfigurationen durch blaue Farbe und Unterstreichung als Hyperlink 
  gekennzeichnet. Ein Klick auf den Link f&uuml;hrt in diesem Fall allerdings 
  nicht wie gewohnt zu einer Anzeige der Konfiguration im aktuell aktiven Display, 
  sondern das Plussymbol zur Expandierung einer Konfiguration wechselt zu der 
  angeklickten Konfiguration. Damit k&ouml;nnen jetzt die unter dieser Konfiguration 
  enthaltenen Objekte in der Baumstruktur expandiert und in ein Display geladen 
  werden, daf&uuml;r sind allerdings die zu der vorhergehenden Konfiguration geh&ouml;renden 
  Objekte jetzt unsichtbar. </p>
<p>Unterhalb der Konfiguration wird die der Konfiguration zugeordnete <b>Ressource</b> 
  angezeigt. Ein Klick auf diesen Hyperlink zeigt im aktiven Display Informationen 
  zum Laufzeitstatus der Ressource an. </p>
<p>Einer Ressource sind ein oder mehrere Tasks zugeordnet. Auf der n&auml;chsten 
  Ebene unterhalb der Ressource befindet sich daher die <b>Task List</b>, die 
  eine Liste aller der Ressource zugeordneten Tasks enth&auml;lt. </p>
<p>Die<b> Message History</b> unterhalb der Task List enth&auml;lt eine Liste 
  der ATCM Control- und benutzerdefinierten Meldungen, die sich auf die Ressource, 
  unterhalb der sich die Message History befindet, beziehen.</p>
<p>Die n&auml;chste Ebenen bilden die in der Task List aufgef&uuml;hrten <b>Tasks</b>. 
  Da eine Ressource mehrere Tasks enthalten kann, k&ouml;nnen auf dieser Ebenen 
  mehrere Tasks in der Baumstruktur untereinander angezeigt werden. </p>
<p>Tasks k&ouml;nnen wiederum mehrere <b>Programme</b> zugeordnet werden. Jede 
  Task kann deshalb expandiert werden. Nach der Expansion sind in der Baumstruktur 
  eine Ebene unterhalb der Task die von der Task aufgerufenen Programminstanzen 
  zu sehen. </p>
<p>Programme k&ouml;nnen ihrerseits wiederum <b>Funktionsbaustein-Instanzen </b>aufrufen. 
  Die von einem Programm aufgerufenen Funktionsbaustein-Instanzen werden daher 
  bei Expansion des Programm-Zweigs auf der n&auml;chsten Ebenen angezeigt.<br>
  Funktionsbaustein-Instanzen bilden die letzte Ebene innerhalb der Baumstruktur. 
  Da Fuktionsbaustein-Instanzen allerdings wieder andere Instanzen von Funktionsbausteinen 
  oder Strukturen aufrufen k&ouml;nnen, kann ab hier die Baumstruktur gem&auml;&szlig; 
  der Aufrufhierarchie beliebig tief verzweigen, je nach dem, wie stark die Funktionsbaustein-Aufrufe 
  geschachtelt sind. </p>
<p> <b>Instanzen von Strukturen</b> werden eine Ebene unterhalb der Funktionsbaustein-Instanz 
  angezeigt, in der die jeweilige Struktur-Instanz deklariert wurde. </p>
<h3><a name="TabFB"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Die Registerkarte Function Blocks</h3>
<img src="pic/FunctionB.gif" width="238" height="140" align="left" class="inP" style="margin-right : 15px"> 
<p>Die Funktionsbaustein-Ansicht ist eine reduzierte Version der in der Projekt-Ansicht 
  dargestellten Projektstruktur. Hier werden auschlie&szlig;lich die in einem 
  Projekt enthaltenen Funktionsbaustein-Instanzen in Baumstruktur angezeigt. Die 
  Gliederung der Ebenen in der Baumstruktur folgt wie in der Projektansicht der 
  Aufrufhierarchie eine Projekts. Aufrufende Funktionsbaustein-Instanzen befinden 
  sich in der Baumstruktur immer eine Ebene h&ouml;her als aufgerufene Funktionsbaustein-Instanzen. 
  Aufrufende Funktionsbaustein-Instanzen sind daher &uuml;ber das Plus-Symbol 
  expandierbar. Unterhalb der expandierten Funktionsbaustein-Instanz werden dann 
  die aufgerufenen Funktionsbaustein-Instanzen angezeigt. <br>
  Angezeigt werden sowohl Instanzen von benutzerdefinierten Funktionsbausteinen 
  als auch von Funktionsbausteinen aus Standardbibliotheken. <br>
  Instanzen von Strukturen werden eine Ebene unterhalb der Funktionsbaustein-Instanz 
  angezeigt, in der die jeweilige Struktur-Instanz deklariert wurde.</p>
<h2><a name="Toolbar"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Die Werkzeugleiste</h2>
<img src="pic/toolbar.gif" width="660" height="48" class="inP"> 
<p>Auf der Werkzeugleiste befinden sich die folgenden Bedienelemente: 
<dl> 
  <dt><b>Layout: </b></dt>
  <dd>Zeigt das aktuelle geladene Layout an. Beim Herunterklappen der Liste werden 
    alle gespeicherten Layouts angezeigt. Per Mausklick auf einen Listeneintrag 
    kann ein anderes Layout geladen werden. <br>
    Siehe: <a href="Layout_GE.htm#LoadLayout">Ein gespeichertes Layout laden</a>.</dd>
  <dt><b>Disk:</b></dt>
  <dd>Ruft den <b>Dialog Save Layout </b>auf. <br>
    Siehe: <a href="Layout_GE.htm#SaveLayout">Ge&auml;nderte Layouts speichern</a></dd>
  <dt><b>Edit:</b></dt>
  <dd>Ruft den Layout Editor auf.<br>
    Siehe: <a href="Layout_GE.htm#EditLayout">Ein Layout im Layout Editor editieren</a></dd>
  <dt><b>Navigator:</b></dt>
  <dd>Blendet die <a href="#NaviView">Navigator-Ansicht</a> ein und aus.</dd>
  <dt><b>Log out:</b></dt>
  <dd>Meldet den gegenw&auml;rtigen Benutzer aus ATCM Console ab und ruft den Pa&szlig;wort-Dialog 
    auf. Diese Schaltfl&auml;che erscheint nur auf der Werkzeugleiste, wenn das 
    aktuell geladene Projekt &uuml;ber einen Pa&szlig;wortschutz verf&uuml;gt. 
    <br>
    Siehe: <a href="Connect_GE.htm#Password">Pa&szlig;wortschutz</a></dd>
  <dt><b>Help</b></dt>
  <dd>Ruft die Online-Hilfe zu ATCM Console auf.</dd>
  <dt><b>About:</b></dt>
  <dd>Zeigt Informationen zur vorliegenden Version von ATCMControl an.</dd>
</dl>
<h2><a name="Statusbar"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Die Statuszeile</h2>
<img src="pic/statuszeile.gif" width="364" height="110" class="inP"> 
<p>Die Statuszeile gliedert sich in drei Abschnitte:</p>
<dl> 
  <dt><b>Linker Abschnitt:</b></dt>
  <dd>Hier werden alle w&auml;hrend der Arbeit mit ATCM Console auftretenden Fehlermeldungen 
    angezeigt. </dd>
  <dt><b>Mittlerer Abschnitt:</b></dt>
  <dd>Hier wird nach einem Download eines in ATCM Console visualisierten Objekts 
    die blinkende Meldung <i>DOWNLOAD</i> in roter Farbe angezeigt. Die Meldung 
    signalisiert, da&szlig; nach einem Download die angezeigten Daten evtl. nicht 
    mehr dem auf ATCM Control geladenen aktuellen Stand entsprechen. Nach der Aktualisierung 
    des Visualisierungsbereichs wird die Meldung wieder ausgeblendet. <br>
    Siehe auch <a href="#refresh">Navigator- und Visualisierungs-Ansicht aktualisieren</a>.</dd>
  <dt><b>Rechter Abschnitt:</b></dt>
  <dd>Hier wird der Gültigkeitszeitraum der <a href="Licence_GE.htm">ATCM Control-Lizenz</a> 
    angezeigt. Beträgt der verbleibende Gültigkeitszeitraum weniger als 3 Tage, 
    wird die Anzeige in roter Farbe dargestellt. Beträgt der Gültigkeitszeitraum 
    nur noch einen Tag, beginnt die Anzeige zu blinken. </dd>
</dl>
<h2><a name="IEPanel"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Die Internet-Navigationsleiste in ATCM Engineering</h2>
<p>Beim Start von ATCM Console aus ATCM Engineering wird das Konsolenfenster ohne 
  die Men&uuml;- und Werkzeugleiste des Internet Explorers ge&ouml;ffnet. Ein 
  Teil der Funktionalit&auml;t des Internet Explorers wird deshalb &uuml;ber die 
  Schaltfl&auml;chen auf der Internet-Navigationsleiste ersetzt, die sich auf 
  der Symbolleiste von ATCM Engineering befindet (siehe auch Abschnitt <a href="#InternetFunctions">Die 
  Internet-Funktionen</a>). Wenn kein Fenster von ATCM Console in ATCM Engineering 
  ge&ouml;ffnet ist, sind diese Schaltfl&auml;chen deaktiviert. Sind dagegen mehrere 
  Fenster von ATCM Console ge&ouml;ffnet, beziehen sich die Funktionen der Schaltfl&auml;chen 
  immer auf das sich im Vordergrund befindende Konsolenfenster. </p>
<img src="pic/InetButton.gif" width="142" height="21" class="inP"> 
<p>Die Funktionen der Schaltfl&auml;chen sind in der folgende Tabelle aufgelistet:</p>
<table border cellpadding=4 width="300" bgcolor="#FFFFFF" bordercolor="#000000" >
  <tr> 
    <td valign=TOP width="35%"><img src="pic/Icback.gif" height=14 width=16></td>
    <td valign=TOP width="65%"><font size=-1><b>Zur&uuml;ck </b>zur vorhergehenden 
      Seite </font></td>
  </tr>
  <tr> 
    <td valign=TOP width="35%"><img src="pic/Icnext.gif" height=14 width=15></td>
    <td valign=TOP width="65%"><font size=-1><b>Vorw&auml;rts </b> zur n&auml;chsten 
      Seite </font></td>
  </tr>
  <tr> 
    <td valign=TOP width="35%"><img src="pic/Icstopnet.gif" height=17 width=16></td>
    <td valign=TOP width="65%"><font size="-1"><b>Abbrechen</b> des Ladevorgangs</font></td>
  </tr>
  <tr> 
    <td valign=TOP width="35%"><img src="pic/Icrefresh.gif" height=15 width=14></td>
    <td valign=TOP width="65%"><font size=-1><b>Seite </b>aktualisieren</font></td>
  </tr>
  <tr> 
    <td valign=TOP width="35%"><img src="pic/Ichome.gif" height=16 width=15></td>
    <td valign=TOP width="65%"><font size=-1> Zur&uuml;ck zur <b>Home-Site</b></font></td>
  </tr>
  <tr> 
    <td valign=TOP width="35%"><img src="pic/Icsearchnet.gif" height=16 width=16></td>
    <td valign=TOP width="65%"><font size=-1><b>Netz </b>durchsuchen</font></td>
  </tr>
</table>
<p>Beachten Sie beim Einsatz der beiden Schaltfl&auml;chen zur <b>R&uuml;ckw&auml;rts-</b> 
  und<b> Vorw&auml;rts-</b>Navigation <img src="pic/ForwBack.gif" width="41" height="17" align="top"> 
  bitte folgendes:<br>
  Beide Schaltfl&auml;chen beziehen sich auf das aktuell aktive Display von ATCM 
  Console. Wenn Sie im Verlauf Ihrer Arbeit mit ATCM Console mehrere Objekte in 
  dasselbe Display geladen haben, k&ouml;nnen Sie mit diesen Schaltfl&auml;chen 
  durch die zuvor geladenen Objekte in der Reihenfolge des Ladevorgangs vor- und 
  zur&uuml;cknavigieren. </p>
<h2><a name="InternetFunctions"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Die Internet-Funktionen</h2>
<p>ATCM Console ist eine in den Internet-Explorer eingebettete Anwendung. Daher 
  stehen Ihnen bei der Arbeit mit ATCM Console prinzipiell auch alle Funktionen 
  zur Verf&uuml;gung, die Ihnen der Internet Explorer ohne ATCM Console bietet. 
  Einige dieser Funktionen k&ouml;nnen Sie zur Steuerung der Navigator- und Visualisierungs-Ansicht 
  nutzen. In diesem Abschnitt nicht dokumentierte Funktionen des Internet Explorers 
  schlagen Sie bitte in der Hilfe zum Internet Explorer nach. </p>
<h3><a name="Refresh"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Navigator- und Visualisierungs-Ansicht aktualisieren</h3>
<p>Die in der Visualisierungs-Ansicht dargestellten Objekte werden innerhalb einer 
  definierten Zykluszeit automatisch aktualisiert. Sind nach einem vollst&auml;ndigen 
  oder inkrementellen Download allerdings neue Objekte oder Variablen im Projekt 
  angelegt worden, werden diese neu hinzugekommenen Elemente nicht automatisch 
  in ATCM Console angezeigt. Bspw. werden Variablen, die vor dem Download innerhalb 
  eines Funktionsbausteins neu angelegt wurden, nach dem Download nicht automatisch 
  in dem Display angezeigt, das den entsprechenden Funktionsbaustein darstellt. 
  Ebensowenig werden neu hinzugekommene Objekte in der Navigator-Ansicht automatisch 
  in die Baumstruktur eingef&uuml;gt. Um Sie auf diese Tatsache aufmerksam zu 
  machen, wird nach einem neuen Download in der Statuszeile die rot blinkende 
  Meldung <i>DOWNLOAD </i>eingeblendet. Damit Sie auch die nach dem Download neu 
  geladenen Elemente in ATCM Console beobachten zu k&ouml;nnen, m&uuml;ssen Sie 
  die Ansichten von ATCM Console aktualisieren. Nach der Aktualisierung verschwindet 
  auch die <i>DOWNLOAD</i>-Meldung wieder. <br>
  Gel&ouml;schte Variablen werden nach einem Download nicht aus dem Display entfernt, 
  sondern signalisieren die OPC-Qualit&auml;t <i>schlecht </i>(siehe auch Abschnitt 
  <a href="VQuality_GE.htm">Variablenqualit&auml;t</a><i> </i>)<i> </i>. Um die 
  nach dem Download g&uuml;ltige Datenorganisation des in ein Display geladenen 
  Objekts anzuzeigen, m&uuml;ssen Sie das entsprechende Display oder die gesamte 
  Visualisierungs-Ansicht manuell aktualisieren.<br>
  Wenn Sie ein ganzes Objekt (z.B. Funktionsbaustein, Task) vor einem Download 
  aus dem Projekt entfernen, wird nach dem Download in dem diesem Objekt zugeordneten 
  Display die Meldung <i>The object &lt;object name&gt; has been removed </i>ausgegeben. 
  Ordnen Sie in diesem Fall dem entsprechenden Display einen neuen g&uuml;ltigen 
  Baustein zu. </p>
<p>Um sowohl die Navigator- als auch die gesamte Visualisierungs-Ansicht zu aktualisieren, 
  klicken Sie auf die Schaltfl&auml;che <b>Aktualisieren</b> auf der Internet 
  Explorer-Werkzeugleiste, falls Sie ATCM Console au&szlig;erhalb von ATCM Engineering 
  gestartet haben, </p>
<p><i>- ODER -</i></p>
<p>klicken Sie auf die Schaltfl&auml;che <img src="pic/IcRefresh.gif" width="14" height="15" align="bottom"> 
  zur Seitenaktualisierung auf der Internet-Navigationsleiste von ATCM Engineering, 
  falls Sie ATCM Console aus ATCM Engineering heraus gestartet haben. </p>
<p>Neben der Aktualisierung der gesamten Navigator- und Visualisierungs-Ansicht 
  haben Sie auch die M&ouml;glichkeit, einzelne Displays zu aktualisieren. Die 
  Download-Meldung wird nach der Aktualisierung eines einzelnen Displays allerdings 
  nicht entfernt. </p>
<p>So gehen Sie vor, um ein einzelnes Display zu aktualisieren:</p>
<ol>
  <li>Klicken Sie mit der rechten Maustaste in den Anzeigebereich des gew&uuml;nschten 
    Displays, um das <b>Kontext</b>-Men&uuml; zu &ouml;ffnen. Das aufgerufene 
    <b>Kontext</b>-Men&uuml; ist ein Men&uuml; des Internet Explorers. Die im 
    Men&uuml; aufgef&uuml;hrten Optionen beziehen sich auf das selektierte Display.</li>
  <li>Klicken Sie im <b>Kontext</b>-Men&uuml; auf die Option <b>Aktualisieren</b>. 
    Da sich das <b>Kontext</b>-Men&uuml; auschlie&szlig;lich auf das selektierte 
    Display bezieht, wird nur dieses Display aktualisiert. </li>
</ol>
<h3><a name="navigate"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  In der Visualisierungs-Ansicht navigieren</h3>
<p>Wenn Sie die in den Displays der Visualisierungs-Ansicht geladenen Objekte 
  austauschen, d.h. in die Displays andere Objekte anstelle der zuvor angezeigten 
  Objekte laden, k&ouml;nnen Sie &uuml;ber die Standard-Funktionen des Internet 
  Explorers Schritt f&uuml;r Schritt die jeweils zuletzt vorgenommene &Auml;nderung 
  r&uuml;ckg&auml;ngig machen, d.h wieder das zuvor angezeigte Objekt in das entsprechende 
  Display laden. </p>
<p>Wenn Sie ATCM Console au&szlig;erhalb von ATCM Engineering gestartet haben, benutzen 
  Sie dazu die Schaltfl&auml;che <b>Zur&uuml;ck</b> auf der Werkzeugleiste des 
  Internet Explorers. Mit jedem Klick auf <b>Zur&uuml;ck</b> nehmen Sie eine &Auml;nderung 
  in der umgekehrten Reihenfolge, in der Sie diese vorgenommen haben, zur&uuml;ck. 
  In jedem Display, in dem Sie ein neues Objekt geladen haben, wird also in der 
  Reihenfolge der vorgenommenen &Auml;nderungen das zuvor geladene Display wieder 
  angezeigt. <br>
  Analog dazu navigieren Sie mit der Schaltfl&auml;che <b>Vorw&auml;rts</b> auf 
  der Werkzeugleiste des Internet Explorers wieder Schritt f&uuml;r Schritt diesmal 
  in entgegengesetzter Richtung durch die in den Displays dargestellten Objekte. 
  &Auml;nderungen in den dargestellten Displays, die Sie &uuml;ber <b>Zur&uuml;ck</b> 
  zur&uuml;ckgenommen haben, werden damit wieder in Kraft gesetzt. Die Schaltfl&auml;che 
  <b>Vorw&auml;rts</b> ist nur dann aktiv, wenn Sie &uuml;ber <b>Zur&uuml;ck</b> 
  schon &Auml;nderungen vorgenommen haben.</p>
<p>Wenn Sie ATCM Console aus ATCM Engineering heraus gestartet haben, bieten Ihnen 
  die Schaltfl&auml;chen <img src="pic/ForwBack.gif" width="41" height="17" align="top"> 
  auf der <a href="#IEPanel">Internet-Navigationsleiste von ATCM Engineering</a> dieselbe 
  Funktionalit&auml;t wie die Schaltfl&auml;chen <b>Zur&uuml;ck</b> und <b>Vorw&auml;rts</b>.</p>
</body>
</html>
