<html>
<head>
<title>Einführung in ATCM Console</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="Manual_GE.css">
</head>

<body bgcolor="#FFFFFF" background="pic/backgrnd.jpg">
<h1> Einf&uuml;hrung</h1>
<p>ATCM Console ist das Visualisierungsmodul f&uuml;r auf ATCM Control geladene Projektdaten. 
  Die Visualisierung der Projektdaten erfolgt in Visualisierungeinheiten, die 
  den im IEC-Programmiermodell definierten Objekten entsprechen. Jeder Objektart 
  (z.B. Task, Funktionsbaustein) ist ein spezifisches Visualisierungschema (im 
  folgenden als Display bezeichnet) zugeordnet, das regelt, welche dem Objekt 
  zugeordneten Daten in welcher Form visualisiert werden. Die visualisierten Daten 
  k&ouml;nnen nicht nur beobachtet werden, sondern lassen sich zum Teil zur Laufzeit 
  eines auf ATCM Control geladenen Projekts ver&auml;ndern. Ebenso kann &uuml;ber 
  Bedienelemente der Visualisierungschemata das Laufzeitverhalten eines Projekts 
  beeinflu&szlig;t werden (Tasks starten u. stoppen usf.).</p>
<p>ATCM Console nutzt zum Datentransfer die OPC-Schnittstelle und zur Visualisierung 
  die Funktionalit&auml;t des Internet Exporers (einschlie&szlig;lich Java, Java 
  Script, VB Script, ASP, HTML). Die Bedienoberfl&auml;che von ATCM Console ist 
  in den Internet Explorer integriert, so da&szlig; Ihnen neben ATCM Console-spezifischen 
  Funktionen auch das Funktionsspektrum des Internet Explorers zur Verf&uuml;gung 
  steht. </p>
<p>Die Zusammenarbeit von OPC-Schnittstelle und Internet Explorer-Funktionalit&auml;t 
  erm&ouml;glicht neben der Beobachtung von auf dem Control des lokalen Rechners 
  geladenen Projekten auch die standortunabh&auml;ngige &Uuml;berwachung und Steuerung 
  von Projekten, die auf dem Control eines beliebigen Remote-Rechners ausgef&uuml;hrt 
  werden, vorausgesetzt, da&szlig; der Console-Rechner &uuml;ber einen Internet-Zugang 
  verf&uuml;gt und mit einer NT-Dom&auml;ne verbunden ist. Dazu mu&szlig; auf 
  dem Rechner, auf dem 4 Console ausgef&uuml;hrt wird, weder ATCM Engineering noch 
  ATCM Control installiert sein. </p>
<h2>&nbsp;</h2>
</body>
</html>
