<html>
<head>
<title>Layouts</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="Manual_GE.css">
</head>

<body bgcolor="#FFFFFF" background="pic/backgrnd.jpg">
<h1>Layouts</h1>
<hr>
<h3><a name="Overview"></a>&Uuml;bersicht</h3>
<ul>
  <a href="#Layout">Mit Layouts arbeiten</a> <br>
  <a href="#EditLayout">Ein Layout im Layout Editor editieren</a> 
  <ul class="inul">
    <a href="#Examples">Beispiele</a><br>
    <a href="#Rules">Regeln zur Gestaltung g&uuml;ltiger Layouts</a> 
  </ul>
  <a href="#OrderDisplay">Layouts &uuml;ber das Kontext-Men&uuml; der Displays 
  bearbeiten</a> 
  <ul class="inul">
    <a href="#ExpandLeft">Ein Display nach links erweitern</a><br>
    <a href="#ExpandRight">Ein Display nach rechts erweitern</a><br>
    <a href="#ExpandUp">Ein Display nach oben erweitern</a><br>
    <a href="#ExpandDown">Ein Display nach unten erweitern</a><br>
    <a href="#InsertLeft">Ein Display auf der linken Seite einf&uuml;gen</a><br>
    <a href="#InsertRight">Ein Display auf der rechten Seite einf&uuml;gen</a><br>
    <a href="#InsertAbove">Ein Display oberhalb eines selektierten Displays einf&uuml;gen</a><br>
    <a href="#InsertBelow">Ein Display unterhalb eines selektierten Displays einf&uuml;gen</a><br>
    <a href="#Clear">Display-Inhalt zur&uuml;cksetzen</a> 
  </ul>
  <a href="#SaveLayout">Ge&auml;nderte Layouts speichern</a><br>
  <a href="#LoadLayout">Ein gespeichertes Layout laden</a><br>
  <a href="#DeleteLayout">Ein Layout löschen</a><br> 
  <a href="Faceplatelayoutexample_GE.htm">Beispiele für Display-Layouts</a> 
</ul>
<hr style="margin-left: 44px">
<h2><a name="Layout"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Mit Layouts arbeiten</h2>
<p>Layouts bilden die Basisstruktur f&uuml;r die Anordnung der in der Visualisierungsansicht 
  dargestellten Displays. Die Anordnung von Displays kann &uuml;ber den <b>Layout-Editor</b> 
  oder &uuml;ber die <b>Kontext</b>-Men&uuml;s der Displays in der Visualisierungs-Ansicht 
  ge&auml;ndert werden. </p>
<p>&Auml;nderungen, die Sie an Layouts vornehmen, erfolgen immer auf der Basis 
  des aktuell aktiven Layouts. Welches Layout aktiv ist , wird im Listenfeld <b>Layout</b> 
  auf der Werkzeugleiste von ATCM Control angezeigt. Falls Sie noch kein neues Layout 
  gespeichert haben, ist das zugrundeliegende Basis-Layout das von ATCM Control 
  verwendete Standardlayout. </p>
<p>Mit dem Layout-Editor oder &uuml;ber das <b>Kontext</b>-Men&uuml; der Displays 
  vorgenommene &Auml;nderungen des Layouts werden nicht automatisch gespeichert. 
  Sobald Sie die gesamte Visualisierungsansicht &uuml;ber die entsprechende Option 
  des Internet Explorers aktualisieren oder ATCM Console neu starten, werden die 
  Displays wieder in der Anordnung des aktuell geladenen Layouts angezeigt. Um 
  &Auml;nderungen an einem Layout dauerhaft beizubehalten, m&uuml;ssen Sie das 
  Layout explizit speichern. <br>
  Zum Speichern und Laden eines Layouts siehe auch die Abschnitte: <a href="#SaveLayout">Ge&auml;nderte 
  Layouts speichern</a> und <a href="#LoadLayout">Gespeicherte Layouts laden</a><b>. 
  </b></p>
<p>Jedesmal, wenn Sie ATCM Console starten, werden die Displays auf Basis des zuletzt 
  verwendeten Layouts angeordnet. Wenn Sie noch kein neues Layout angelegt und 
  gespeichert haben, wird f&uuml;r die Anordnung der Displays das Standardlayout 
  von ATCM Console verwendet.</p>
<h2><a name="EditLayout"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Ein Layout im Layout Editor editieren</h2>
<p>Um ein Layout zu editieren, starten Sie den<b> Layout Editor</b>, indem Sie 
  auf die Schaltfl&auml;che <b>Edit</b> auf der Werkzeugleiste von ATCM Console 
  oder auf die Option<b> Edit Layout </b>im <b>Kontext</b>-Men&uuml; eines beliebigen 
  Displays klicken. </p>
<img src="pic/ViewEditor.gif" width="450" height="600" class="inP"> 
<p>Die im Layout Editor gezeigte Anordnung der Displays entspricht immer dem Layout, 
  das aktuell in ATCM Console angezeigt wird, auch wenn dieses noch nicht gespeichert 
  wurde. Wenn Sie noch kein Layout in ATCM Console bearbeitet haben, sehen Sie die 
  in der obigen Abbildung gezeigte Struktur. Diese ist identisch mit dem in ATCM 
  Console verwendeten Standardlayout. Die auf diesem Layout basierende Displayanordnung 
  in der Visualisierungs-Ansicht zeigt das folgende Bild:</p>
<img src="pic/StandardLayout.gif" width="442" height="346" class="inP">
<p>Wie Sie durch Vergleich beider Bilder erkennen k&ouml;nnen, entspricht jeweils 
  einem Display eine Reihe von Quadraten mit gleicher Farbe und Nummer im Layout 
  Editor. In obiger Abbildung wird also das erste Display von links von den grauen 
  Quadraten mit der Nummer <i>1</i>, das zweite Display von den blauen Quadraten 
  mit der Nummer <i>2</i> usf. im Layout Editor repr&auml;sentiert. </p>
<p>Sie k&ouml;nnen Gr&ouml;&szlig;e und Position der Displays im Layout Editor 
  &auml;ndern. Dazu gehen Sie folgenderma&szlig;en vor:</p>
<ol>
  <li>Ganz oben im Layout Editor befindet sich eine Reihe von numerierten farbigen 
    Quadraten. Jedes Quadrat repr&auml;sentiert ein separates Display. Klicken 
    Sie mit der linken Maustaste auf eines dieser Quadrate. Das angeklickte Quadrat 
    wird jetzt &auml;hnlich einer gedr&uuml;ckten Schaltfl&auml;che versunken 
    dargestellt, und signalisiert damit, da&szlig; es aktiv ist. </li>
  <li>Der sich unterhalb dieser Quadrate befindende Bereich repr&auml;sentiert 
    das in der Visualisierungs-Ansicht dargestellte Layout. Das Layout ist in 
    4 x 4 Quadrate eingeteilt. Diese bilden ein Raster, das m&ouml;gliche Positionen 
    f&uuml;r die Plazierung eines Displays angibt. Klicken Sie in eines der Quadrate. 
    Das Quadrat wird jetzt in der Farbe und mit der Nummer dargestellt, die Sie 
    zuvor durch Mausklick auf eines der Quadrate in der oberen Reihe aktiviert 
    haben.</li>
  <li>Um die Fl&auml;che, die ein Display einnehmen soll, festzulegen, klicken 
    Sie auf weitere Quadrate, so da&szlig; diese eine zusammenh&auml;ngende Fl&auml;che 
    bilden. Die Fl&auml;che, die ein Display sp&auml;ter in der Visualisierungsansicht 
    einnehmen wird, wird durch die Quadrate mit gleicher Farbe und Nummer bestimmt. 
    Es ist auch m&ouml;glich, ein Display, das aus nur einem einzigen Quadrat 
    besteht, zu erzeugen. </li>
  <li>Wenn Ihr Display die gew&uuml;nschte Position und Gr&ouml;&szlig;e hat, 
    klicken Sie wieder in der oberen Reihe der Quadrate auf ein anderes Quadrat, 
    um Position und Gr&ouml;&szlig;e eines weiteren Displays festzulegen. Alle 
    Aktionen, die Sie ab jetzt in dem sich unterhalb der Quadratreihe befindenen 
    Bereich vornehmen, werden jetzt mit der Farbe und Nummer des aktivierten Quadrats 
    ausgef&uuml;hrt. </li>
  <li>Um den Layout Editor wieder zu schlie&szlig;en und das Ergebnis Ihrer Anordnung 
    anzusehen, klicken Sie auf <b>OK</b>. Wollen Sie dagegen Ihre &Auml;nderungen 
    am Layout verwerfen, klicken Sie auf <b>Cancel</b>.</li>
</ol>
<h3><b><a name="Examples"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  </b>Beispiele</h3>
<p>Ausgehend von dem oben zu sehenden Standardlayout werden wir jetzt die Displays 
  so anordnen, da&szlig; die diese nicht mehr nebeneinander positioniert sind, 
  sondern sich je zwei Displays in der oberen und der unteren H&auml;lfte der 
  Visualisierungs-Ansicht befinden. Dazu mu&szlig; das Raster im Layout Editor 
  so belegt werden, da&szlig; jeweils 2 x 2 Quadrate mit der gleichen Farbe und 
  Nummer gef&uuml;llt sind:</p>
<img src="pic/Layout2x2.gif" width="450" height="600" class="inP"> 
<p>In der Visualisierungsansicht resultiert daraus die folgende Anordnung:</p>
<img src="pic/Visu2x2.gif" width="421" height="314" class="inP">
<p>Um die beiden oben liegenden Displays untereinander statt nebeneinander anzuordnen, 
  werden beide Displays in jeweils einer horizontalen Reihe zu je 4 Quadraten 
  angeordnet: </p>
<img src="pic/Layouthr.gif" width="450" height="600" class="inP"> 
<p>Die Visualisierungsansicht zeigt nun folgendes Bild:</p>
<img src="pic/Visuhr.gif" width="420" height="314" class="inP"> 
<p>Weitere Beispiele f&uuml;r Layouts finden Sie im Abschnitt <a href="Faceplatelayoutexample_GE.htm">Beispiele 
  f&uuml;r Display-Layouts</a>. </p>
<h3><b><a name="Rules"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a></b> 
  Regeln zur Gestaltung g&uuml;ltiger Layouts</h3>
<p>Displays k&ouml;nnen im Layout Editor nicht beliebig angeordnet werden. Sie 
  m&uuml;ssen daher einige Regeln einhalten, um ein Layout zu erstellen, das als 
  g&uuml;ltiges Layout in der Visualisierungsansicht angezeigt werden kann:</p>
<ul>
  <li>Quadrate derselben Farbe und Nummer m&uuml;ssen so angeordnet werden, da&szlig; 
    sie einen zusammenh&auml;ngenden Bereich bilden, da ein Display nicht auf 
    mehrere r&auml;umlich nicht zusammenh&auml;ngede Stellen in der Visualisierungs-Ansicht 
    verteilt werden kann. </li>
  <li>Displays d&uuml;rfen nicht L-f&ouml;rmig sein, d.h Quadrate derselben Farbe 
    und Nummer d&uuml;rfen nicht in L-Form angeordnet werden.</li>
  <li>Displays d&uuml;rfen nicht kreisf&ouml;rmig angeordnet werden (siehe dazu 
    <a href="Faceplatelayoutexample_GE.htm#rotate">Beispiel f&uuml;r kreisf&ouml;rmige 
    Anordnung</a>).</li>
</ul>
<p>Ob die aktuelle Anordnung von Displays ein g&uuml;ltiges Layout ergibt, wird 
  im Layout-Editor in der Textzeile links neben den beiden Schaltfl&auml;chen 
  <b>OK</b> und <b>Cancel</b> angezeigt. Ergibt die aktuelle Anordnung der Displays 
  ein g&uuml;ltiges Layout, zeigt die Textzeile den Text<b> Faceplate Layout: 
  Valid</b> an. Ergibt die aktuelle Anordnung kein g&uuml;ltiges Layout, erscheint 
  dagegen der Text <b>Faceplate Layout: Invalid</b>. Die Schaltfl&auml;che <b>OK</b> 
  ist in diesem Fall deaktiviert, so da&szlig; ein ung&uuml;ltiges Layout nicht 
  in die Visualisierungs-Ansicht &uuml;bernommen werden kann.</p>
<p>Beispiele f&uuml;r ung&uuml;ltige und g&uuml;ltige Layouts finden Sie im Abschnitt 
  <a href="Faceplatelayoutexample_GE.htm">Beispiele f&uuml;r Display-Layouts</a>.</p>
<h2> <a name="OrderDisplay"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Layouts &uuml;ber das Kontext-Men&uuml; der Displays bearbeiten </h2>
<p>Jedes Display verf&uuml;gt &uuml;ber ein <b>Kontext</b>-Men&uuml;, &uuml;ber 
  das sich Position und Gr&ouml;&szlig;e des Displays beeinflussen lassen. &Uuml;ber 
  <b>Expand</b>-Optionen k&ouml;nnen Displays nach links oder rechts expandiert 
  , &uuml;ber <b>Insert</b>-Optionen k&ouml;nnen weitere Displays in die Visualisierungs-Ansicht 
  eingef&uuml;gt werden. &Uuml;ber das <b>Kontext</b>-Men&uuml; vorgenommene &Auml;nderungen 
  werden in das aktuell aktive Layout &uuml;bernommen und im Layout-Editor angezeigt. 
  <br>
  Zus&auml;tzlich enth&auml;lt das <b>Kontext</b>-Men&uuml; zwei Optionen zum 
  Zur&uuml;cksetzen des im Display dargestellten Objekts und die Optionen <b>Edit 
  Layout</b> zum Bearbeiten und <b>Copy Layout</b> zum Kopieren eines Layouts 
  (zu diesen Optionen siehe die Abschnitte<a href="#EditLayout"> Ein Layout im 
  Layout Editor bearbeiten</a> und <a href="#SaveLayout">Ein ge&auml;ndertes Layout 
  speichern</a>). </p>
<p>Die Optionen des <b>Kontext</b>-Men&uuml;s sind kontextsensitiv, d.h. es werden 
  nur die Optionen im Men&uuml; angezeigt, die im Zusammenhang mit der aktuellen 
  Position eines Displays sinnvoll sind. Befindet sich ein Display bspw. bereits 
  am linken Ende der Visualisierungs-Ansicht, kann dieses Display nicht weiter 
  nach links expandiert werden. Die Option <b>Expand Left </b>erscheint in diesem 
  Fall also nicht im <b>Kontext</b>-Men&uuml; des entsprechenden Displays. Generell 
  gilt, da&szlig; ein Display nur in die Richtung expandiert werden kann, in der 
  sich noch andere Displays befinden. Analog gilt f&uuml;r das Einf&uuml;gen von 
  Displays &uuml;ber die <b>Insert</b>-Optionen, da&szlig; die <b>Insert</b>-Optionen 
  zum Einf&uuml;gen von Displays nur dann angezeigt werden, wenn die maximale 
  Anzahl von 4 Displays in einer vertikalen oder horizontalen Reihe der Visualisierungs-Ansicht 
  noch nicht erreicht ist.</p>
<p>Beim Einf&uuml;gen eines zus&auml;tzlichen Displays &uuml;ber die <b>Insert</b>-Optionen 
  wird in der Regel ein leeres Display eingef&uuml;gt. Haben Sie allerdings vor 
  dem Einf&uuml;gen eines Displays ein oder mehrere Displays &uuml;ber eine <b>Expand</b>-Option 
  aus der Visualisierungs-Ansicht entfernt (siehe Abschnitt <a href="#ExpandLeft">Ein 
  Display nach links erweitern</a>), wird in den eingef&uuml;gten Displays das 
  zuerst entfernte und bis zum Zeitpunkt des Einf&uuml;gens nicht mehr angezeigte 
  Objekt geladen. </p>
<p>Sie rufen das <b>Kontext</b>-Men&uuml; eines Displays auf, indem Sie mit der 
  rechten Maustaste auf die Kopfleiste des gew&uuml;nschten Displays klicken. 
  Beachten Sie, da&szlig; nur bei Klick auf die Display-Kopfleiste das displayspezifische 
  Kontext-Men&uuml; aufgerufen wird, w&auml;hrend Sie bei Klick auf den Darstellungsbereich 
  des Displays ein <b>Kontext</b>-Men&uuml; &ouml;ffnen, das Optionen des Internet 
  Explorers enth&auml;lt.</p>
<img src="pic/DisplayContext.gif" width="209" height="219" class="inP"> 
<h3><a name="ExpandLeft"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Ein Display nach links erweitern</h3>
<p>&Uuml;ber die Option<b> Expand Left</b> erweitern Sie ein Display nach links. 
  Das sich vor dem Aktivieren dieser Option auf der linken Seite des selektierten 
  Displays befindende Display wird nicht mehr angezeigt. Statt dessen nimmt nun 
  das expandierte Display zus&auml;tzlich zu der Fl&auml;che, die es zu vor belegt 
  hat, auch die Fl&auml;che des Displays ein, das sich zuvor auf dessen linker 
  Seite befunden hat. </p>
<p>Expandieren Sie bspw. das unten im Bild zu sehende Display, das die Funktionsbaustein-Instanz 
  <i>time_count</i> visualisiert, wird das die Funktionsbaustein-Instanz <i>pulse</i> 
  darstellende Display durch Fl&auml;che des nach links erweiterten Displays ersetzt. 
</p>
<img src="pic/BExpandLeft.gif" width="560" height="266" class="inP">
<p class="Bildunterschrift">Vor Expansion von time-count nach links</p>
<img src="pic/ExpandLeft.gif" width="557" height="266" class="inP"> 
<p class="Bildunterschrift">Nach Expansion von time-count nach links</p>
<h3><a name="ExpandRight"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Ein Display nach rechts erweitern</h3>
<p>&Uuml;ber die Option<b> Expand Right</b> erweitern Sie ein Display nach rechts. 
  Die Anzeige eines nach rechts erweiterten Displays erfolgt analog zur <a href="#ExpandLeft">Erweiterung 
  eines Displays nach links</a>. </p>
<h3><a name="ExpandUp"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Ein Display nach oben erweitern</h3>
<p>Falls sich &uuml;ber einem Display ein weiteres Display befindet, k&ouml;nnen 
  Sie das unten liegenden Display &uuml;ber die Option <b>Expand Up</b> nach oben 
  erweitern. Das sich vor dem Aktivieren dieser Option oberhalb des selektierten 
  Displays befindende Display wird nicht mehr angezeigt. Statt dessen nimmt nun 
  das expandierte Display zus&auml;tzlich zu dem Raum, den es zu vor belegt hat, 
  auch den Raum des Displays ein, das sich zuvor oberhalb des expandierten Displays 
  befunden hat. </p>
<p>Expandieren Sie bspw. das unten im Bild zu sehende Display, das die Funktionsbaustein-Instanz 
  <i>time-count</i> visualisiert, wird das die Funktionsbaustein-Instanz <i>rise_edge2 
  </i> darstellende Display durch die Fl&auml;che des nach oben erweiterten Displays 
  ersetzt. </p>
<img src="pic/InsertUp.gif" width="559" height="262" class="inP"> 
<p class="Bildunterschrift">Vor Expansion von time_count nach oben</p>
<img src="pic/ExpandUp.gif" width="556" height="262" class="inP"> 
<p class="Bildunterschrift">Nach Expansion von time_count nach oben</p>
<h3><a name="ExpandDown"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Ein Display nach unten erweitern</h3>
<p>Falls sich unterhalb eines Displays ein weiteres Display befindet, k&ouml;nnen 
  Sie das oben liegende Display &uuml;ber die Option <b>Expand Down</b> nach unten 
  erweitern. Die Anzeige eines nach unten erweiterten Displays erfolgt analog 
  zur <a href="#ExpandUp">Erweiterung eines Displays nach oben</a>. </p>
<h3><a name="InsertLeft"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Ein Display auf der linken Seite einf&uuml;gen</h3>
<p>&Uuml;ber die Option<b> Insert Left</b> k&ouml;nnen Sie ein Display auf der 
  linken Seite eines selektierten Displays einf&uuml;gen. Das selektierte Display 
  wird um die Fl&auml;che verkleinert, die das auf der linken Seite eingef&uuml;gte 
  Display zur Darstellung ben&ouml;tigt. </p>
<p>F&uuml;gen Sie bspw. links nebem dem unten im Bild zu sehenden Display, das 
  die Funktionsbaustein-Instanz <i>timer_base</i> visualisiert, ein Display ein, 
  wird das Display um die Fl&auml;che verkleinert, die das neu eingef&uuml;gte 
  Display zur Darstellung ben&ouml;tigt. </p>
<img src="pic/BInsertLeft.gif" width="557" height="258" class="inP"> 
<p class="Bildunterschrift">Vor Einf&uuml;gen eines Displays auf der linken Seite 
  von timer_base</p>
<img src="pic/InsertLeft.gif" width="558" height="258" class="inP"> 
<h4 class="Bildunterschrift">Nach Einf&uuml;gen eines Displays auf der linken 
  Seite von timer_base</h4>
<h3><a name="InsertRight"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Ein Display auf der rechten Seite einf&uuml;gen</h3>
<p>&Uuml;ber die Option<b> Insert Right</b> k&ouml;nnen Sie ein Display auf der 
  rechten Seite eines selektierten Displays einf&uuml;gen. Die Anzeige eines auf 
  der rechten Seite eingef&uuml;gten Displays erfolgt analog zum <a href="#InsertLeft">Einf&uuml;gen 
  eines Displays auf der linken Seite</a>. </p>
<h3><a name="InsertAbove"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Ein Display oberhalb eines selektierten Displays einf&uuml;gen</h3>
<p>&Uuml;ber die Option<b> Insert Above</b> k&ouml;nnen Sie ein Display oberhalb 
  eines selektierten Displays einf&uuml;gen. Das selektierte Display wird um die 
  Fl&auml;che verkleinert, die das oberhalb dieses Display eingef&uuml;gte Display 
  zur Darstellung ben&ouml;tigt. </p>
<p>F&uuml;gen Sie bspw. &uuml;ber dem unten im Bild zu sehenden Display, das die 
  Funktionsbaustein-Instanz <i>time_count </i> visualisiert, ein Display ein, 
  wird das Display um die Fl&auml;che verkleinert, die das neu eingef&uuml;gte 
  Display zur Darstellung ben&ouml;tigt. </p>
<img src="pic/ExpandUp.gif" width="556" height="262" class="inP"> 
<p class="Bildunterschrift">Vor Einf&uuml;gen eines Displays oberhalb von time_count</p>
<img src="pic/InsertUp.gif" width="555" height="265" class="inP"> 
<p class="Bildunterschrift">Nach Einf&uuml;gen eines Displays oberhalb von time_count</p>
<h3><a name="InsertBelow"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Ein Display unterhalb eines selektierten Displays einf&uuml;gen</h3>
<p>&Uuml;ber die Option<b> Insert Below</b> k&ouml;nnen Sie ein Display unterhalb 
  eines selektierten Displays einf&uuml;gen. Die Anzeige eines unten eingef&uuml;gten 
  Displays erfolgt analog zum<a href="#InsertAbove"> Einf&uuml;gen eines Displays 
  oberhalb eines aktuell selektierten Displays</a>. </p>
<h3><a name="Clear"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Display-Inhalt zur&uuml;cksetzen</h3>
<p>&Uuml;ber die Option <b>Clear</b> des <b>Kontext</b>-Men&uuml;s setzen Sie 
  das Display in einen leeren Zustand zur&uuml;ck. Das zuvor in dem ausgew&auml;hlten 
  Display dargestellte Objekt wird nicht mehr angezeigt und die Kopfleiste des 
  Displays zeigt die Beschriftung <i>Empty</i>. </p>
<p>&Uuml;ber die Option <b>Clear</b> <b>All</b> wird der Inhalt aller in ATCM Console 
  angezeigten Displays in eine leeren Zustand zur&uuml;ckgesetzt.</p>
<h2><a name="SaveLayout"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Ge&auml;nderte Layouts speichern</h2>
<p>&Auml;nderungen, die Sie an einem Layout vorgenommen haben, werden nicht automatisch 
  gespeichert und gehen daher verloren, sobald Sie ATCM Console schlie&szlig;en 
  oder die gesamte Visualisierungs-Ansicht aktualisieren. Sie m&uuml;ssen daher 
  ein Layout explizit speichern, um &Auml;nderungen an einem Layout dauerhaft 
  beizubehalten.</p>
<p>Grundlage f&uuml;r das Speichern eines Layouts ist die aktuell in der Visualisierungs-Ansicht 
  dargestellte Anordnung der Displays. Gespeichert werden sowohl &Auml;nderungen, 
  die &uuml;ber den Layout-Editor, als auch &Auml;nderungen, die &uuml;ber das 
  <b>Kontext</b>-Men&uuml; vorgenommen wurden. Haben Sie an einem Layout &Auml;nderungen 
  vorgenommen und noch nicht gespeichert, wird im Listenfeld <b>Layout</b> auf 
  der Werkzeugleiste von ATCM Console der Eintrag <i>[Unsaved Layout] </i>angezeigt.<br>
  Beim Speichern eines Layouts wird nicht nur die aktuelle Position und Gr&ouml;&szlig;e 
  der Displays, sondern auch die Verkn&uuml;pfung zu den Objekten, die aktuell 
  in den Displays dargestellt werden, gespeichert. Wenn Sie ein gespeichertes 
  Display laden, werden daher auch die den Displays zugeordneten Objekte wieder 
  in den entsprechenden Displays visualisiert, sofern noch eine g&uuml;ltige Verbindung 
  zu dem betreffenden Objekt besteht. Besteht die Verbindung zu dem Control, auf 
  dem das Objekt geladen wurde, nicht mehr, oder wurde das Objekt aus dem Projekt 
  entfernt, wird in den den entsprechenden Objekten zugeordneten Displays die 
  Meldung <i>The object &lt;object name&gt; has been removed ! </i>angezeigt. 
</p>
<p>Gehen sie folgenderma&szlig;en vor, um ein ge&auml;ndertes Layout zu speichern:</p>
<ol>
  <li>Klicken Sie nach dem Editieren eines Layouts auf die Schaltfl&auml;che <b>Disk</b> 
    auf der Werkzeugleiste von ATCM Engineering,<br>
    <br>
    <i>- ODER -</i><br>
    <br>
    klicken Sie mit der rechten Maustaste auf die farbige Kopfleiste eines beliebigen 
    Displays, um das <b>Kontext</b>-Men&uuml; aufzurufen, und w&auml;hlen Sie 
    dort die Option <b>Copy Layout</b>.<br>
    <br>
  </li>
  <li>Geben Sie den Namen des neuen Layouts im unteren Eingabefeld des Dialogs 
    ein. Die Schaltfl&auml;che <b>Save as</b> wird mit der Eingabe des ersten 
    Zeichens aktiviert. <br>
    <br>
    <img src="pic/savefaceplate.gif" width="600" height="280"> <br>
    <br>
  </li>
  <li>Klicken Sie auf die Schaltfl&auml;che <b>Save as</b>, um das Layout in die 
    Liste <b>Available Layouts</b> zu &uuml;bernehmen. Das Layout steht ab jetzt 
    unter dem neuen Namen im Listenfeld der Werkzeugleiste von ATCM Console zur 
    Auswahl zur Verf&uuml;gung. <br>
    <br>
  </li>
  <li>Klicken Sie auf <b>Exit</b>, um das Dialogfeld <b>Save Layout</b> wieder 
    zu schlie&szlig;en. Das gespeicherte Layout wird automatisch zum aktuell aktiven 
    Layout. </li>
</ol>
<p>Sie k&ouml;nnen mehrere Layouts speichern, indem Sie nach dem &Auml;ndern eines 
  Layouts wieder den Dialog <b>Save and Delete Layout </b>aufrufen und einen neuen 
  Namen f&uuml;r das ge&auml;nderte Layout eingeben. Das Layout wird wie zuvor 
  wieder in die Liste <b>Available Layouts</b> &uuml;bernommen.<br>
  Nach dem Speichern wird das zuletzt gespeicherte Layout automatisch zum aktuell 
  aktiven Layout und im Listenfeld <b>Layout</b> auf der Werkzeugleiste von ATCM 
  Console angezeigt. </p>
<p>Gespeicherte Layouts werden in ATCM Console intern verwaltet und nicht als Dateien 
  abgelegt. Das Kopieren von Layouts auf Diskette zum Einsatz auf einem anderen 
  Rechner ist daher nicht m&ouml;glich. </p>
<h2><a name="LoadLayout"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Ein gespeichertes Layout laden</h2>
<p>Wenn Sie bereits ein oder mehrere Layouts gespeichert haben, wird das momentan 
  geladene Layout im Listenfeld <b>Layout</b> auf der Werkzeugleiste von ATCM Console 
  angezeigt.</p>
<p>Um ein anderes Layout zu laden</p>
<ol>
  <li>klicken Sie im Listenfeld <b>Layout</b> auf die Schaltfl&auml;che mit dem 
    nach unten zeigenden Pfeil, um die Liste des Listenfelds aufzuklappen. In 
    der Liste werden alle gespeicherten Layouts angezeigt.</li>
  <li>Klicken Sie mit der linken Maustaste auf das gew&uuml;nschte Layout, um 
    dieses zu laden. Nach einem kurzen Zeitraum, den ATCMControl f&uuml;r den Neuaufbau 
    der Visualisierungsansicht ben&ouml;tigt, werden die Displays im selektierten 
    Layout angezeigt. </li>
</ol>
<img src="pic/SelectLayout.gif" width="504" height="277" class="inP"> 
<h2><a name="DeleteLayout"></a><a href="#Overview"><img src="pic/Jump.gif" width="11" height="9" border="0"></a> 
  Ein Layout l&ouml;schen</h2>
<ol>
  <li>Klicken Sie auf die Schaltfl&auml;che <b>Disk</b>, um den Dialog <b>Save 
    Layout </b>aufzurufen.<br>
    <br>
  </li>
  <li>In der Liste <b>Available Layouts</b> werden alle gespeicherten Layouts 
    aufgef&uuml;hrt. W&auml;hlen Sie in der Liste das gew&uuml;nschte Layout aus. 
    Sobald Sie ein Layout markiert haben, wird die zuvor inaktive Schaltfl&auml;che 
    <b>Delete</b> aktiviert, und der Name des selektierten Layouts im unteren 
    Feld des Dialogs angezeigt. Wenn Sie w&auml;hrend der Auswahl der Layouts 
    die <b>STRG</b>- oder die <b>Shift</b>-Taste gedr&uuml;ckt halten, k&ouml;nnen 
    Sie mehrere Layouts auf einmal ausw&auml;hlen.<br>
    <br>
    <img src="pic/deleteLayout.gif" width="600" height="280"><br>
    <br>
  </li>
  <li>Klicken Sie auf <b>Delete</b>, um das selektierte Layout zu l&ouml;schen. 
    <br>
    <br>
  </li>
  <li>Klicken Sie auf <b>Exit</b>, um den Dialog zu schlie&szlig;en.</li>
</ol>
<div style="margin-left: 5; position: relative; top: 0"> 
  <h2></h2>
</div>
</body>
</html>
