<html>
<head>
<title>UDP_SOCKET_HANDLE</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="Lib.css"></head>

<body bgcolor="#FFFFCC">
<h2>UDP_SOCKET_HANDLE </h2>
<p>Repr&auml;sentiert den Socket, &uuml;ber den Operationen zum Datentransfer 
  ausgef&uuml;hrt werden.</p>
<h3>Schnittstelle</h3>
<pre class="preforma">TYPE
    UDP_SOCKET_HANDLE : STRUCT
        LocalPort         : DInt;      
        LocalAddr         : WString;   
        LastPartnerPort   : DInt;      
        LastPartnerAddr   : WString;   
        LastCmd           : DInt;      
        LastError         : Bool;         
        LastErrorNr       : DInt;      
        LastErrorString   : WString;
        BroadcastSocket   : Bool;
    END_STRUCT;
END_TYPE
</pre>
<h3>Strukturelemente</h3>
<p><b>LocalPort</b></p>
<p>Wert vom Typ <i><b>DINT</b></i> <br>
  Legt die vom lokalen Rechner verwendete Portnummer fest. Der unter dieser Nummer 
  angegebene Port wird beim Herstellen einer Verbindung mit einer Instanz von 
  <i> <b>UDP_CONNECT</b></i> generiert. Es k&ouml;nnen Nummern ab 1025 frei vergeben 
  werden. Nummern bis einschlie&szlig;lich 1024 sind teilweise fest f&uuml;r Dienste 
  wie z.B. FTP reserviert. </p>
<p><b>LocalAddr </b></p>
<p>Wert vom Typ <i><b>WSTRING</b></i> <br>
  Enth&auml;lt den Host-Namen des lokalen Rechners.<b> </b> </p>
<p><b>LastPartnerPort </b></p>
<p>Wert vom Typ <i><b>DINT</b></i> <br>
  Enth&auml;lt die Portnummer des Ports, von dem zuletzt eine Nachricht von einem 
  Kommunikationspartner empfangen wurde. </p>
<p><b>LastPartnerAddr</b></p>
<p>Wert vom Typ <i><b>WSTRING</b></i><br>
  Enth&auml;lt die IP-Adresse des Rechners, von dem zuletzt eine Botschaft empfangen 
  wurde. </p>
<p><b>LastCmd</b></p>
<p>Wert vom Typ <i><b>DINT</b></i> <br>
  Enth&auml;lt die Nummer der letzten Operation, die zuletzt auf den durch eine 
  Instanz von <i><b>UDP_SOCKET_HANDLE</b></i> repr&auml;sentierten Socket ausgef&uuml;hrt 
  wurde. <br>
  M&ouml;gliche Werte sind in den <a href="ConstCmd.htm">UDP-Befehlskonstanten</a> 
  definiert.</p>
<p><b>LastError</b></p>
<p>Wert vom Typ <i><b>BOOL</b></i> <br>
  Zeigt an, ob bei der letzten Operation auf den durch eine Instanz von <i><b>UDP_SOCKET_HANDLE</b></i> 
  repr&auml;sentierten Socket ein Fehler aufgetreten ist.<br>
  M&ouml;gliche Werte:<br>
  <b><i>TRUE</i></b>: Ein Fehler ist aufgetreten.<br>
  <b><i>FALSE</i></b>: Es ist kein Fehler aufgetreten. </p>
<p><b>LastErrorNr</b></p>
<p>Wert vom Typ <i><b>DINT</b></i><br>
  Enth&auml;lt eine Fehlernummer, wenn bei der letzten Operation, die auf einen 
  durch eine Instanz von <i><b>UDP_SOCKET_HANDLE</b></i> repr&auml;sentierten 
  Socket ausgef&uuml;hrt wurde, ein Fehler aufgetreten ist. <br>
  Ist kein Fehler aufgetreten, hat diese Strukturvariable den Wert 0.<br>
  M&ouml;gliche Werte sind in den <a href="ConstUDPErr.htm">UDP-Fehlerkonstanten</a> 
  definiert.</p>
<p><b>LastErrorString</b></p>
<p>Wert vom Typ <i><b>WSTRING</b></i><br>
  Enth&auml;lt eine Fehlerbeschreibung, wenn bei der letzten Operation, die auf 
  einen durch eine Instanz von <i><b>UDP_SOCKET_HANDLE </b></i> repr&auml;sentierten 
  Socket ausgef&uuml;hrt wurde, ein Fehler aufgetreten ist. Ist kein Fehler aufgetreten, 
  enth&auml;lt diese Strukturvariable einen Leerstring. </p>
<p><b>BroadcastSocket</b></p>
<p>Wert vom Typ <b><i>BOOL</i></b><br>
  Legt fest, ob &uuml;ber den von einer Instanz von <i><b>UDP_SOCKET_HANDLE</b></i> 
  repr&auml;sentierten Socket ein Broadcast m&ouml;glich ist. Verwenden Sie die 
  Adresse 255.255.255.255, um einen Broadcast mit einer Instanz von <i><b><a href="UDP_USEND.htm">UDP_USEND</a></b></i> 
  durchzuf&uuml;hren. Diese Adresse ist fest f&uuml;r die Durchf&uuml;hrung von 
  Broadcasts reserviert. <br>
  M&ouml;gliche Werte:<br>
  <b><i>TRUE</i></b>: Broadcast kann durchgef&uuml;hrt werden.<br>
  <b><i>FALSE</i></b>: Broadcast kann nicht durchgef&uuml;hrt werden. </p>
<h3>Beschreibung</h3>
<p>Eine Instanz der Struktur <i><b>UDP_SOCKET_HANDLE</b></i> repr&auml;sentiert 
  einen Socket. </p>
<p>Um den Datentransfer &uuml;ber den Socket zu erm&ouml;glichen, mu&szlig; der 
  Socket durch Aufruf einer Instanz von <i><b><a href="UDP_CONNECT.htm">UDP_CONNECT</a></b></i> 
  initialisiert werden.</p>
<p>Vor der Initialisierung mu&szlig; der Socket mit einem Port verbunden werden. 
  Dazu wird dem Strukturelement <i><b>LocalPort</b></i> von <i> <b>UDP_SOCKET_HANDLE</b></i> 
  die Adresse des Ports zugewiesen. Es k&ouml;nnen Port-Nummern ab 1025 vergeben 
  werden. Niedrigere Adressen werden evtl. fest f&uuml;r Dienste wie bspw. FTP 
  verwendet. Um Konflikte zu vermeiden, sollten daher nur Nummern &uuml;ber 1024 
  f&uuml;r Ports vergeben werden. Durch &Uuml;bergabe des Werts 0 an <i><b>LocalPort</b></i> 
  wird veranlasst, da&szlig; die Socket-Implementation selbst nach einer freien 
  Portadresse sucht. </p>
<p>Der Parameter <i><b>BroadcastSocket </b></i> mu&szlig; nur dann initialisiert 
  werden, wenn der Socket zur Durchf&uuml;hrung von Broadcasts verwendet werden 
  soll. Dazu mu&szlig; diese Strukturvariable mit <i><b>TRUE</b></i> initialisiert 
  werden. Als Broadcast wird das Versenden einer Botschaft an alle per Socket 
  miteinander kommunizierenden Rechner bezeichnet. Da in diesem Fall der Instanz 
  von <a href="UDP_USEND.htm"><b><i>UDP_USEND</i></b></a>, die die Botschaft versendet, 
  nicht die Adresse eines bestimmten Rechners &uuml;bergeben werden kann, wird 
  beim Senden einer Botschaft an alle Rechner die Adresse '255.255.255.255' an 
  den Parameter <i><b>PARTNER_ADDR</b></i> von <i><b>UDP_USEND</b></i> &uuml;bergeben. 
</p>
<p>Alle anderen Parameter m&uuml;ssen nicht initialisiert werden, da sie der Auswertung 
  von Verbindungsdaten und Fehlerstatus der auf den Socket ausgef&uuml;hrten Operationen 
  dienen. Diese Werte werden jeweils nach der Ausf&uuml;hrung einer entsprechenden 
  Operation automatisch gesetzt. </p>
</body>
</html>
